{
  "architectures": [
    "DeepseekV3ForCausalLM"
  ],
  "model_type": "deepseek_v3",
  "initializer_range": 0.05,
  "hidden_size": 1536,
  "intermediate_size": 4096,
  "num_hidden_layers": 12,
  "num_attention_heads": 12,
  "num_key_value_heads": 12,
  "v_head_dim": 128,
  "qk_nope_head_dim": 128,
  "qk_rope_head_dim": 16,
  "q_lora_rank": 384,
  "kv_lora_rank": 192,
  "moe_layer_freq": 1,
  "first_k_dense_replace": 2,
  "n_routed_experts": 48,
  "n_shared_experts": 1,
  "num_experts_per_tok": 3,
  "moe_intermediate_size": 320,
  "n_group": 1,
  "topk_group": 1,
  "vocab_size": 73448,
  "max_position_embeddings": 4096,
  "hidden_act": "silu",
  "rms_norm_eps": 1e-06,
  "rope_theta": 10000.0,
  "attention_bias": false,
  "attention_dropout": 0.0,
  "topk_method": "noaux_tc",
  "scoring_func": "sigmoid",
  "norm_topk_prob": true,
  "routed_scaling_factor": 2.5,
  "use_cache": true,
  "bos_token_id": 1,
  "eos_token_id": [
    2,
    73440
  ],
  "torch_dtype": "bfloat16",
  "tie_word_embeddings": true
}