{
  "_name_or_path": "/home/zhupeiyin/code/pretrain-LLM-from-scratch/final/",
  "architectures": [
    "HolmesForCausalLM"
  ],
  "auto_map": {
    "AutoConfig": "modeling_holmes.HolmesConfig",
    "AutoModelForCausalLM": "modeling_holmes.HolmesForCausalLM"
  },
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 1,
  "eos_token_id": [
    2,
    73440
  ],
  "ep_size": 1,
  "first_k_dense_replace": 2,
  "hidden_act": "silu",
  "hidden_size": 1536,
  "initializer_range": 0.05,
  "intermediate_size": 4096,
  "kv_lora_rank": 192,
  "max_position_embeddings": 4096,
  "model_type": "holmes",
  "moe_intermediate_size": 320,
  "moe_layer_freq": 1,
  "n_group": 1,
  "n_routed_experts": 48,
  "n_shared_experts": 1,
  "norm_topk_prob": true,
  "num_attention_heads": 12,
  "num_experts_per_tok": 4,
  "num_hidden_layers": 12,
  "num_key_value_heads": 12,
  "num_nextn_predict_layers": 1,
  "q_lora_rank": 384,
  "qk_nope_head_dim": 128,
  "qk_rope_head_dim": 16,
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 10000.0,
  "routed_scaling_factor": 2.5,
  "scoring_func": "sigmoid",
  "tie_word_embeddings": true,
  "topk_group": 1,
  "topk_method": "noaux_tc",
  "torch_dtype": "bfloat16",
  "transformers_version": "4.46.0",
  "use_cache": false,
  "v_head_dim": 128,
  "vocab_size": 73448
}
