{
  "_name_or_path": "HolmesLLMXS/",
  "_attn_implementation": "flash_attention_2",
  "architectures": [
    "HolmesLLMForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "configuration_holmesllm.HolmesLLMConfig",
    "AutoModelForCausalLM": "modeling_holmesllm.HolmesLLMForCausalLM"
  },
  "bos_token_id": 1,
  "eos_token_id": 2,
  "head_dim": 32,
  "hidden_act": "silu",
  "hidden_size": 512,
  "initializer_range": 0.02,
  "intermediate_size": 1536,
  "layer_sharing": true,
  "max_position_embeddings": 4096,
  "mlp_bias": false,
  "model_type": "holmesllm",
  "num_attention_heads": 16,
  "num_hidden_layers": 10,
  "num_key_value_heads": 4,
  "pad_token_id": 145,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "rope_theta": 10000.0,
  "share_embedding": true,
  "tie_word_embeddings": false,
  "torch_dtype": "float16",
  "transformers_version": "4.46.2",
  "use_cache": true,
  "vocab_size": 64000
}
